/********************************************************************
	日期:	2019/01/30
	时间:	   11:25
	文件名: 	F:\CPROJECT\PROJECT\example168.c
	格式:	c
	作者:	$ kilotwo $
	目的:	打印特殊方阵
*********************************************************************/
#include "stdio.h"

main()
{
	int i,j;
	int a[10][10];
	for (i=1;i<=5;i++)
	{	for (j=i;j<=10-i;j++)
		{
			a[i][j]=i;	//第一行全部为1//第二行
			a[j][i]=i;	//第一列全为1
			a[10-i][j]=i;	//第九行全部为1
			a[j][10-i]=i;	//第九列全部为1
		}
	}

	for (i=1;i<10;i++)
	{	for (j=1;j<10;j++)
		{
			printf("%d  ",a[i][j]);
		}
	printf("\n");
	}
}