/********************************************************************
	日期:	2019/01/16
	时间:	   21:07
	文件名: 	F:\CPROJECT\PROJECT1\example9.c
	格式:	c
	作者:	$ kilotwo $
	目的:	打印菱形
*********************************************************************/
#include "stdio.h"
	main()
	{
	    //4个空格 1个形状
		//3个空格 3个形状
		//2个空格 5个形状
		//1个空格 7个形状
		//0个空格 9个形状
	int i=0,j=0,k=0;
		for (i=0;i<5;i++)
	{
		for (j=0;j<4-i;j++)
		printf(" ");
		for(k=0;k<2*i+1;k++)
		printf("#");
		printf("\n");
	}
		//1个空格 7个形状
		//2个空格 5个形状
		//3个空格 3个形状
		//4个空格 1个形状
	
		for (i=0;i<4;i++)
		{
			for (j=0;j<i+1;j++)
				printf(" ");
			for(k=7;k>2*i;k--)
				printf("#");
			printf("\n");
	}
	
	}