/********************************************************************
	日期:	2019/01/28
	时间:	   14:45
	文件名: 	F:\CPROJECT\PROJECT\example125.c
	格式:	c
	作者:	$ kilotwo $
	目的:	125两位数乘积大于和的数
*********************************************************************/
#include "stdio.h"
main()
{
	int count=0,n;
	int a=0,b=0;	//a是十位数 b是个位数
	for (n=11;n<100;n++)
	{
		a=n/10;
		b=n%10;
		if (a*b>a+b)
		{
			count++;
			printf("%3d  ",a*10+b);
			if (count%5==0)
			{
				printf("\n");
			}
			

		}
	}

}